In [1]:
import pandas as pd

In [2]:
d = pd.read_csv("/home/majji-vinaykumar/Documents/abc.csv")

In [3]:
df = pd.DataFrame(d)
print(df)

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [4]:
di = {"Name":["vinay","varun","raju"],"ROLL":[2,3,4],"gpa":[23,43,53]}

In [5]:
df = pd.DataFrame(di)
print(df)

    Name  ROLL  gpa
0  vinay     2   23
1  varun     3   43
2   raju     4   53

In [6]:
d = [("Viany",2,23),("varun",3,43),("raju",4,53)]

In [7]:
df = pd.DataFrame(d)
print(df)

       0  1   2
0  Viany  2  23
1  varun  3  43
2   raju  4  53

In [8]:
d = pd.read_csv("/home/majji-vinaykumar/Documents/abc.csv")
df = pd.DataFrame(d)
print(df)

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [9]:
print(df.describe())

        language    science      maths    history
count   7.000000   7.000000   7.000000   7.000000
mean   54.285714  53.000000  43.285714  42.857143
std    35.523299  22.015146  23.746679  17.062909
min    10.000000  23.000000  12.000000  23.000000
25%    25.000000  39.500000  33.000000  33.000000
50%    50.000000  56.000000  45.000000  34.000000
75%    90.000000  61.500000  45.000000  55.000000
max    90.000000  90.000000  90.000000  67.000000

In [10]:
df.loc[3]

student     janice
language        20
science         67
maths           90
history         45
Name: 3, dtype: object

In [11]:
df.loc[0:3,"science":"history"]

   science  maths  history
0       56     34       34
1       34     32       67
2       23     12       32
3       67     90       45

In [12]:
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [13]:
df.iloc[[0,3,5],[1,2]]

   language  science
0        90       56
3        20       67
5        90       45

In [14]:
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [15]:
df.sort_values("maths",ascending=False)

  student  language  science  maths  history
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32

In [16]:
df.sort_values(["student","language"])

  student  language  science  maths  history
6  carrol        50       90     45       23
3  janice        20       67     90       45
1   kevin        10       34     32       67
0   kumar        90       56     34       34
4   peter        30       56     45       65
5    prem        90       45     45       34
2   sammy        90       23     12       32

In [17]:
df["total"]=0

In [18]:
df.drop(columns="total",inplace=True)

In [19]:
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [20]:
d = pd.read_csv("/home/majji-vinaykumar/Documents/abc1.csv")
df = pd.DataFrame(d)

In [21]:
df

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
2   sammy       NaN       23   12.0       32
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
5    prem      90.0       45    NaN       34
6  carrol      50.0       90   45.0       23

In [22]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [26]:
df

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
2   sammy       NaN       23   12.0       32
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
5    prem      90.0       45    NaN       34
6  carrol      50.0       90   45.0       23

In [28]:
df.duplicated(columns="language")

TypeError: DataFrame.duplicated() got an unexpected keyword argument 'columns'

In [29]:
df.fillna(80)

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
2   sammy      80.0       23   12.0       32
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
5    prem      90.0       45   80.0       34
6  carrol      50.0       90   45.0       23

In [30]:
df

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
2   sammy       NaN       23   12.0       32
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
5    prem      90.0       45    NaN       34
6  carrol      50.0       90   45.0       23

In [31]:
df["maths"].fillna(80)

0    34.0
1    32.0
2    12.0
3    90.0
4    45.0
5    80.0
6    45.0
Name: maths, dtype: float64

In [32]:
df

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
2   sammy       NaN       23   12.0       32
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
5    prem      90.0       45    NaN       34
6  carrol      50.0       90   45.0       23

In [33]:
df.dropna()

  student  language  science  maths  history
0   kumar      90.0       56   34.0       34
1   kevin      10.0       34   32.0       67
3  janice      20.0       67   90.0       45
4   peter      30.0       56   45.0       65
6  carrol      50.0       90   45.0       23

In [35]:
d = pd.read_csv("/home/majji-vinaykumar/Documents/abc.csv")
df = pd.DataFrame(d)
df

  student  language  science  maths  history
0   kumar        90       56     34       34
1   kevin        10       34     32       67
2   sammy        90       23     12       32
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23

In [37]:
df.loc[df["maths"]>40]

  student  language  science  maths  history
3  janice        20       67     90       45
4   peter        30       56     45       65
5    prem        90       45     45       34
6  carrol        50       90     45       23